{
  "intents": [
    {
      "tag": "chao_hoi",
      "patterns": ["Chào", "Xin chào", "Hi", "Hello", "Chào buổi sáng", "Chào buổi tối"],
      "responses": ["Chào bạn! Tôi có thể giúp gì cho bạn hôm nay?", "Xin chào! Bạn cần hỗ trợ gì ạ?"]
    },
    {
      "tag": "dia_diem",
      "patterns": ["Tôi muốn đến Đà Nẵng", "Tôi muốn đặt phòng ở Huế", "Tôi muốn đặt phòng tại Hội An", "Tôi muốn nghỉ tại Đà Nẵng", "Tôi cần đặt phòng ở Huế."],
      "responses": ["Rất tuyệt! Bạn muốn đặt phòng tại {location}. Vui lòng cung cấp ngày check-in để tôi kiểm tra phòng trống."]
    },
    {
      "tag": "kiem_tra_phong_trong",
      "patterns": ["Khách sạn có phòng trống không?", "Có phòng nào ở Hà Nội không?", "Phòng trống tại Đà Nẵng?"],
      "responses": ["Vâng, tôi sẽ kiểm tra phòng trống tại {location}. Bạn có thể cung cấp ngày muốn đặt không?"]
    },
    {
      "tag": "dich_vu_khach_san",
      "patterns": ["Khách sạn có dịch vụ gì?", "Tiện ích tại khách sạn là gì?", "Khách sạn có bể bơi không?"],
      "responses": ["Khách sạn chúng tôi có các tiện ích như Wi-Fi miễn phí, bể bơi, spa và nhà hàng. Bạn cần hỗ trợ thêm thông tin gì không?"]
    },
    {
      "tag": "hoi_gia",
      "patterns": [ "Giá phòng Suite là bao nhiêu?","Cho tôi hỏi giá phòng tại khách sạn Merry Land Hotel","Giá phòng Standard là bao nhiêu tại khách sạn ABC?"],
      "responses": ["Giá phòng phụ thuộc vào loại phòng. Vui lòng cho biết thông tin chi tiết để tôi kiểm tra giá giúp bạn."]
    },
    {
      "tag": "hoi_loai_phong",
      "patterns": ["Khách sạn có những loại phòng nào?","Các loại phòng tại đây là gì?","Cho tôi biết về các loại phòng?","Có phòng đơn không?","Phòng đôi có không?","Khách sạn có phòng gia đình không?","Các loại phòng hiện có là gì?"],
      "responses": ["Khách sạn chúng tôi có các loại phòng: Phòng đơn, Phòng đôi, Phòng gia đình và Phòng suite. Bạn muốn biết thêm chi tiết về loại nào?","Chúng tôi cung cấp các loại phòng: Phòng đơn, Phòng đôi, và Phòng suite. Bạn muốn tìm hiểu thêm về loại phòng nào?","Hiện tại, khách sạn có các loại phòng như sau: Phòng đơn, Phòng đôi, Phòng gia đình. Bạn quan tâm đến loại phòng nào?"]
    },
    {
      "tag": "dat_phong",
      "patterns": ["Tôi muốn đặt phòng", "Đặt phòng giúp tôi", "Có thể đặt phòng ở đây không?", "Làm sao để đặt phòng?", "Tôi muốn đặt phòng ở Đà Nẵng ngày mai", "Đặt phòng tại khách sạn A", "Tôi cần đặt phòng tại khách sạn B cho tuần tới"],
      "responses": ["Bạn muốn đặt phòng tại đâu và khi nào? Vui lòng cung cấp ngày check-in và check-out.", "Rất vui lòng hỗ trợ! Bạn có thể cho tôi biết địa điểm, ngày check-in, và loại phòng bạn muốn đặt?", "Để đặt phòng, vui lòng cung cấp thông tin sau: địa điểm, ngày check-in, ngày check-out, và loại phòng."]
    }
  ]
}
